#w7_課堂練習(小組作業)：
#綜合運用至目前所學(基本運算、變數、字串、List、Dict、Tupe、Set、If、For、While、Def）自行規劃議題及問題
#小組作業
#以"課堂練習範本.doc"格式繳交至Moodle
#以下僅是簡單概念，請同學舉一反三，發揮創意進行議題規劃及問題定義

#----
#議題方向1
#小明準備開一間烏拉拉早餐店，他正在計畫菜單內容，
#此外他還想要根據菜單搭配都是$100塊，且包含各種品項的套餐供客人選擇。
#Set-List運用：小明想要將早餐店轉型成早午餐店，故須增加產品品項並修改套餐內容。
#---
#問題定義
#小明要先將餐點名稱及金額輸入app，
#之後客人再根據菜單品項，搭配包含各種品項，點選營養均衡的套餐。
#新增餐點項目，例如"早午餐"。S
#比較早餐與午餐的品項。
#提示使用tuple為key，利用update()新增List的餐品項，用tuple key修改餐點品。

#----
#議題方向2S
#確診統計：分國內確診數、境外移入確診數、死亡數
#確診數有日期、診數有男女、國內確診數有不同縣市、境外移入有不同國家或地區等

#----
#程式設計思維，需考慮人(user)與AI夥伴(App)的人際互動對話....
  